results/db-set/openresty.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        etyude
Server Hostname:        localhost
Server Port:            1500

Document Path:          /db-set
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   14.291 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1350000 bytes
HTML transferred:       0 bytes
Requests per second:    699.72 [#/sec] (mean)
Time per request:       14.291 [ms] (mean)
Time per request:       1.429 [ms] (mean, across all concurrent requests)
Transfer rate:          92.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     7   14   1.6     14      24
Waiting:        7   14   1.6     14      24
Total:          7   14   1.6     14      24

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     14
  80%     14
  90%     17
  95%     19
  98%     19
  99%     20
 100%     24 (longest request)