results/db-set/php.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Apache
Server Hostname:        localhost
Server Port:            80

Document Path:          /load-testing/db-set.php
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   14.433 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1500000 bytes
HTML transferred:       0 bytes
Requests per second:    692.88 [#/sec] (mean)
Time per request:       14.433 [ms] (mean)
Time per request:       1.443 [ms] (mean, across all concurrent requests)
Transfer rate:          101.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     9   14   2.3     14      60
Waiting:        9   14   2.3     14      59
Total:          9   14   2.3     14      60

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     14
  80%     14
  90%     17
  95%     19
  98%     20
  99%     20
 100%     60 (longest request)